      * SYMBOLIC MAP of SM0001 Created by CACXBMS Version 6.0.27
       01  SM001MI.
	   02  FILLER				      PIC X(12).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(003).
	   02  DATE1L				      PIC S9(4) COMP.
	   02  DATE1F				      PIC X.
	   02  FILLER REDEFINES DATE1F.
	       03  DATE1A			      PIC X.
	   02  DATE1I				      PIC X(010).
	   02  TIME1L				      PIC S9(4) COMP.
	   02  TIME1F				      PIC X.
	   02  FILLER REDEFINES TIME1F.
	       03  TIME1A			      PIC X.
	   02  TIME1I				      PIC X(008).
	   02  TITLEL				      PIC S9(4) COMP.
	   02  TITLEF				      PIC X.
	   02  FILLER REDEFINES TITLEF.
	       03  TITLEA			      PIC X.
	   02  TITLEI				      PIC X(020).
	   02  STATUSL				      PIC S9(4) COMP.
	   02  STATUSF				      PIC X.
	   02  FILLER REDEFINES STATUSF.
	       03  STATUSA			      PIC X.
	   02  STATUSI				      PIC X(010).
	   02  TODATEL				      PIC S9(4) COMP.
	   02  TODATEF				      PIC X.
	   02  FILLER REDEFINES TODATEF.
	       03  TODATEA			      PIC X.
	   02  TODATEI				      PIC X(010).
	   02  FRDATEL				      PIC S9(4) COMP.
	   02  FRDATEF				      PIC X.
	   02  FILLER REDEFINES FRDATEF.
	       03  FRDATEA			      PIC X.
	   02  FRDATEI				      PIC X(010).
	   02  OPTN1L				      PIC S9(4) COMP.
	   02  OPTN1F				      PIC X.
	   02  FILLER REDEFINES OPTN1F.
	       03  OPTN1A			      PIC X.
	   02  OPTN1I				      PIC X(001).
	   02  OPTN2L				      PIC S9(4) COMP.
	   02  OPTN2F				      PIC X.
	   02  FILLER REDEFINES OPTN2F.
	       03  OPTN2A			      PIC X.
	   02  OPTN2I				      PIC X(001).
	   02  OPTN3L				      PIC S9(4) COMP.
	   02  OPTN3F				      PIC X.
	   02  FILLER REDEFINES OPTN3F.
	       03  OPTN3A			      PIC X.
	   02  OPTN3I				      PIC X(001).
	   02  OPTN4L				      PIC S9(4) COMP.
	   02  OPTN4F				      PIC X.
	   02  FILLER REDEFINES OPTN4F.
	       03  OPTN4A			      PIC X.
	   02  OPTN4I				      PIC X(001).
	   02  OPTN5L				      PIC S9(4) COMP.
	   02  OPTN5F				      PIC X.
	   02  FILLER REDEFINES OPTN5F.
	       03  OPTN5A			      PIC X.
	   02  OPTN5I				      PIC X(001).
	   02  OPTN6L				      PIC S9(4) COMP.
	   02  OPTN6F				      PIC X.
	   02  FILLER REDEFINES OPTN6F.
	       03  OPTN6A			      PIC X.
	   02  OPTN6I				      PIC X(001).
	   02  OPTN7L				      PIC S9(4) COMP.
	   02  OPTN7F				      PIC X.
	   02  FILLER REDEFINES OPTN7F.
	       03  OPTN7A			      PIC X.
	   02  OPTN7I				      PIC X(001).
	   02  OPTN8L				      PIC S9(4) COMP.
	   02  OPTN8F				      PIC X.
	   02  FILLER REDEFINES OPTN8F.
	       03  OPTN8A			      PIC X.
	   02  OPTN8I				      PIC X(001).
	   02  OPTN9L				      PIC S9(4) COMP.
	   02  OPTN9F				      PIC X.
	   02  FILLER REDEFINES OPTN9F.
	       03  OPTN9A			      PIC X.
	   02  OPTN9I				      PIC X(001).
	   02  OPTN10L				      PIC S9(4) COMP.
	   02  OPTN10F				      PIC X.
	   02  FILLER REDEFINES OPTN10F.
	       03  OPTN10A			      PIC X.
	   02  OPTN10I				      PIC X(001).
	   02  OPTN11L				      PIC S9(4) COMP.
	   02  OPTN11F				      PIC X.
	   02  FILLER REDEFINES OPTN11F.
	       03  OPTN11A			      PIC X.
	   02  OPTN11I				      PIC X(001).
	   02  DETL1L				      PIC S9(4) COMP.
	   02  DETL1F				      PIC X.
	   02  FILLER REDEFINES DETL1F.
	       03  DETL1A			      PIC X.
	   02  DETL1I				      PIC X(069).
	   02  DETL2L				      PIC S9(4) COMP.
	   02  DETL2F				      PIC X.
	   02  FILLER REDEFINES DETL2F.
	       03  DETL2A			      PIC X.
	   02  DETL2I				      PIC X(069).
	   02  DETL3L				      PIC S9(4) COMP.
	   02  DETL3F				      PIC X.
	   02  FILLER REDEFINES DETL3F.
	       03  DETL3A			      PIC X.
	   02  DETL3I				      PIC X(069).
	   02  DETL4L				      PIC S9(4) COMP.
	   02  DETL4F				      PIC X.
	   02  FILLER REDEFINES DETL4F.
	       03  DETL4A			      PIC X.
	   02  DETL4I				      PIC X(069).
	   02  DETL5L				      PIC S9(4) COMP.
	   02  DETL5F				      PIC X.
	   02  FILLER REDEFINES DETL5F.
	       03  DETL5A			      PIC X.
	   02  DETL5I				      PIC X(069).
	   02  DETL6L				      PIC S9(4) COMP.
	   02  DETL6F				      PIC X.
	   02  FILLER REDEFINES DETL6F.
	       03  DETL6A			      PIC X.
	   02  DETL6I				      PIC X(069).
	   02  DETL7L				      PIC S9(4) COMP.
	   02  DETL7F				      PIC X.
	   02  FILLER REDEFINES DETL7F.
	       03  DETL7A			      PIC X.
	   02  DETL7I				      PIC X(069).
	   02  DETL8L				      PIC S9(4) COMP.
	   02  DETL8F				      PIC X.
	   02  FILLER REDEFINES DETL8F.
	       03  DETL8A			      PIC X.
	   02  DETL8I				      PIC X(069).
	   02  DETL9L				      PIC S9(4) COMP.
	   02  DETL9F				      PIC X.
	   02  FILLER REDEFINES DETL9F.
	       03  DETL9A			      PIC X.
	   02  DETL9I				      PIC X(069).
	   02  DETL10L				      PIC S9(4) COMP.
	   02  DETL10F				      PIC X.
	   02  FILLER REDEFINES DETL10F.
	       03  DETL10A			      PIC X.
	   02  DETL10I				      PIC X(069).
	   02  DETL11L				      PIC S9(4) COMP.
	   02  DETL11F				      PIC X.
	   02  FILLER REDEFINES DETL11F.
	       03  DETL11A			      PIC X.
	   02  DETL11I				      PIC X(069).
	   02  ERRMSG1L 			      PIC S9(4) COMP.
	   02  ERRMSG1F 			      PIC X.
	   02  FILLER REDEFINES ERRMSG1F.
	       03  ERRMSG1A			      PIC X.
	   02  ERRMSG1I 			      PIC X(071).
       01  SM001MO REDEFINES SM001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(003).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATE1O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIME1O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TITLEO				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATUSO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TODATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FRDATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL1O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL2O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL3O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL4O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL5O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL6O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL7O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL8O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL9O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL10O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL11O				      PIC X(069).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSG1O 			      PIC X(071).
