      * SYMBOLIC MAP of SM00S Created by CACXBMS Version 6.0.27
       01  SM00MI.
	   02  FILLER				      PIC X(12).
	   02  OPTN01L				      PIC S9(4) COMP.
	   02  OPTN01F				      PIC X.
	   02  FILLER REDEFINES OPTN01F.
	       03  OPTN01A			      PIC X.
	   02  OPTN01I				      PIC X(020).
	   02  OPTN02L				      PIC S9(4) COMP.
	   02  OPTN02F				      PIC X.
	   02  FILLER REDEFINES OPTN02F.
	       03  OPTN02A			      PIC X.
	   02  OPTN02I				      PIC X(020).
	   02  OPTN03L				      PIC S9(4) COMP.
	   02  OPTN03F				      PIC X.
	   02  FILLER REDEFINES OPTN03F.
	       03  OPTN03A			      PIC X.
	   02  OPTN03I				      PIC X(020).
	   02  OPTN04L				      PIC S9(4) COMP.
	   02  OPTN04F				      PIC X.
	   02  FILLER REDEFINES OPTN04F.
	       03  OPTN04A			      PIC X.
	   02  OPTN04I				      PIC X(020).
	   02  OPTN05L				      PIC S9(4) COMP.
	   02  OPTN05F				      PIC X.
	   02  FILLER REDEFINES OPTN05F.
	       03  OPTN05A			      PIC X.
	   02  OPTN05I				      PIC X(020).
	   02  OPTN06L				      PIC S9(4) COMP.
	   02  OPTN06F				      PIC X.
	   02  FILLER REDEFINES OPTN06F.
	       03  OPTN06A			      PIC X.
	   02  OPTN06I				      PIC X(020).
	   02  OPTN07L				      PIC S9(4) COMP.
	   02  OPTN07F				      PIC X.
	   02  FILLER REDEFINES OPTN07F.
	       03  OPTN07A			      PIC X.
	   02  OPTN07I				      PIC X(020).
	   02  OPTIONL				      PIC S9(4) COMP.
	   02  OPTIONF				      PIC X.
	   02  FILLER REDEFINES OPTIONF.
	       03  OPTIONA			      PIC X.
	   02  OPTIONI				      PIC X(001).
	   02  TICKETL				      PIC S9(4) COMP.
	   02  TICKETF				      PIC X.
	   02  FILLER REDEFINES TICKETF.
	       03  TICKETA			      PIC X.
	   02  TICKETI				      PIC X(006).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
       01  SM00MO REDEFINES SM00MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN01O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN02O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN03O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN04O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN05O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN06O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN07O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTIONO				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TICKETO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
