      * SYMBOLIC MAP of SM000 Created by CACXBMS Version 6.0.27
       01  SM00MI.
	   02  FILLER				      PIC X(12).
	   02  OPTN01L				      PIC S9(4) COMP.
	   02  OPTN01F				      PIC X.
	   02  FILLER REDEFINES OPTN01F.
	       03  OPTN01A			      PIC X.
	   02  OPTN01I				      PIC X(020).
	   02  OPTN02L				      PIC S9(4) COMP.
	   02  OPTN02F				      PIC X.
	   02  FILLER REDEFINES OPTN02F.
	       03  OPTN02A			      PIC X.
	   02  OPTN02I				      PIC X(020).
	   02  OPTN03L				      PIC S9(4) COMP.
	   02  OPTN03F				      PIC X.
	   02  FILLER REDEFINES OPTN03F.
	       03  OPTN03A			      PIC X.
	   02  OPTN03I				      PIC X(020).
	   02  OPTN04L				      PIC S9(4) COMP.
	   02  OPTN04F				      PIC X.
	   02  FILLER REDEFINES OPTN04F.
	       03  OPTN04A			      PIC X.
	   02  OPTN04I				      PIC X(020).
	   02  OPTN05L				      PIC S9(4) COMP.
	   02  OPTN05F				      PIC X.
	   02  FILLER REDEFINES OPTN05F.
	       03  OPTN05A			      PIC X.
	   02  OPTN05I				      PIC X(020).
	   02  OPTN06L				      PIC S9(4) COMP.
	   02  OPTN06F				      PIC X.
	   02  FILLER REDEFINES OPTN06F.
	       03  OPTN06A			      PIC X.
	   02  OPTN06I				      PIC X(020).
	   02  OPTN07L				      PIC S9(4) COMP.
	   02  OPTN07F				      PIC X.
	   02  FILLER REDEFINES OPTN07F.
	       03  OPTN07A			      PIC X.
	   02  OPTN07I				      PIC X(020).
	   02  OPTIONL				      PIC S9(4) COMP.
	   02  OPTIONF				      PIC X.
	   02  FILLER REDEFINES OPTIONF.
	       03  OPTIONA			      PIC X.
	   02  OPTIONI				      PIC X(001).
	   02  TICKETL				      PIC S9(4) COMP.
	   02  TICKETF				      PIC X.
	   02  FILLER REDEFINES TICKETF.
	       03  TICKETA			      PIC X.
	   02  TICKETI				      PIC X(001).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
       01  SM00MO REDEFINES SM00MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN01O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN02O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN03O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN04O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN05O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN06O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN07O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTIONO				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TICKETO				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
       01  SM001MI.
	   02  FILLER				      PIC X(12).
	   02  ERRMSG1L 			      PIC S9(4) COMP.
	   02  ERRMSG1F 			      PIC X.
	   02  FILLER REDEFINES ERRMSG1F.
	       03  ERRMSG1A			      PIC X.
	   02  ERRMSG1I 			      PIC X(071).
	   02  DATE1L				      PIC S9(4) COMP.
	   02  DATE1F				      PIC X.
	   02  FILLER REDEFINES DATE1F.
	       03  DATE1A			      PIC X.
	   02  DATE1I				      PIC X(010).
	   02  TIME1L				      PIC S9(4) COMP.
	   02  TIME1F				      PIC X.
	   02  FILLER REDEFINES TIME1F.
	       03  TIME1A			      PIC X.
	   02  TIME1I				      PIC X(008).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(003).
	   02  TODATEL				      PIC S9(4) COMP.
	   02  TODATEF				      PIC X.
	   02  FILLER REDEFINES TODATEF.
	       03  TODATEA			      PIC X.
	   02  TODATEI				      PIC X(010).
	   02  FRDATEL				      PIC S9(4) COMP.
	   02  FRDATEF				      PIC X.
	   02  FILLER REDEFINES FRDATEF.
	       03  FRDATEA			      PIC X.
	   02  FRDATEI				      PIC X(010).
	   02  SELECTD OCCURS 011 TIMES.
	       03  SELECTL			      PIC S9(4) COMP.
	       03  SELECTF			      PIC X.
	       03  FILLER REDEFINES SELECTF.
		   04  SELECTA			      PIC X.
	       03  SELECTI			      PIC X(001).
	   02  TIXNUMD OCCURS 011 TIMES.
	       03  TIXNUML			      PIC S9(4) COMP.
	       03  TIXNUMF			      PIC X.
	       03  FILLER REDEFINES TIXNUMF.
		   04  TIXNUMA			      PIC X.
	       03  TIXNUMI			      PIC X(006).
	   02  TIXTITLED OCCURS 011 TIMES.
	       03  TIXTITLEL			      PIC S9(4) COMP.
	       03  TIXTITLEF			      PIC X.
	       03  FILLER REDEFINES TIXTITLEF.
		   04  TIXTITLEA		      PIC X.
	       03  TIXTITLEI			      PIC X(025).
	   02  STATSD OCCURS 011 TIMES.
	       03  STATSL			      PIC S9(4) COMP.
	       03  STATSF			      PIC X.
	       03  FILLER REDEFINES STATSF.
		   04  STATSA			      PIC X.
	       03  STATSI			      PIC X(010).
	   02  LSTUPDD OCCURS 011 TIMES.
	       03  LSTUPDL			      PIC S9(4) COMP.
	       03  LSTUPDF			      PIC X.
	       03  FILLER REDEFINES LSTUPDF.
		   04  LSTUPDA			      PIC X.
	       03  LSTUPDI			      PIC X(008).
	   02  UPDBYD OCCURS 011 TIMES.
	       03  UPDBYL			      PIC S9(4) COMP.
	       03  UPDBYF			      PIC X.
	       03  FILLER REDEFINES UPDBYF.
		   04  UPDBYA			      PIC X.
	       03  UPDBYI			      PIC X(006).
       01  SM001MO REDEFINES SM001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSG1O 			      PIC X(071).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATE1O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIME1O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(003).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TODATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FRDATEO				      PIC X(010).
	   02  DFHMS001 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  SELECTO			      PIC X(001).
	   02  DFHMS002 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  TIXNUMO			      PIC X(006).
	   02  DFHMS003 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  TIXTITLEO			      PIC X(025).
	   02  DFHMS004 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  STATSO			      PIC X(010).
	   02  DFHMS005 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  LSTUPDO			      PIC X(008).
	   02  DFHMS006 OCCURS 011 TIMES.
	       03  FILLER			      PIC XX.
	       03  FILLER			      PIC X.
	       03  UPDBYO			      PIC X(006).
