      * SYMBOLIC MAP of SM0001 Created by CACXBMS Version 6.0.27
       01  SM001MI.
	   02  FILLER				      PIC X(12).
	   02  ERRMSG1L 			      PIC S9(4) COMP.
	   02  ERRMSG1F 			      PIC X.
	   02  FILLER REDEFINES ERRMSG1F.
	       03  ERRMSG1A			      PIC X.
	   02  ERRMSG1I 			      PIC X(071).
	   02  DATE1L				      PIC S9(4) COMP.
	   02  DATE1F				      PIC X.
	   02  FILLER REDEFINES DATE1F.
	       03  DATE1A			      PIC X.
	   02  DATE1I				      PIC X(010).
	   02  TIME1L				      PIC S9(4) COMP.
	   02  TIME1F				      PIC X.
	   02  FILLER REDEFINES TIME1F.
	       03  TIME1A			      PIC X.
	   02  TIME1I				      PIC X(008).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(003).
	   02  TITLEL				      PIC S9(4) COMP.
	   02  TITLEF				      PIC X.
	   02  FILLER REDEFINES TITLEF.
	       03  TITLEA			      PIC X.
	   02  TITLEI				      PIC X(010).
	   02  STATUSL				      PIC S9(4) COMP.
	   02  STATUSF				      PIC X.
	   02  FILLER REDEFINES STATUSF.
	       03  STATUSA			      PIC X.
	   02  STATUSI				      PIC X(010).
	   02  TODATEL				      PIC S9(4) COMP.
	   02  TODATEF				      PIC X.
	   02  FILLER REDEFINES TODATEF.
	       03  TODATEA			      PIC X.
	   02  TODATEI				      PIC X(010).
	   02  FRDATEL				      PIC S9(4) COMP.
	   02  FRDATEF				      PIC X.
	   02  FILLER REDEFINES FRDATEF.
	       03  FRDATEA			      PIC X.
	   02  FRDATEI				      PIC X(010).
	   02  SELECTL				      PIC S9(4) COMP.
	   02  SELECTF				      PIC X.
	   02  FILLER REDEFINES SELECTF.
	       03  SELECTA			      PIC X.
	   02  SELECTI				      PIC X(001).
	   02  TIXNUML				      PIC S9(4) COMP.
	   02  TIXNUMF				      PIC X.
	   02  FILLER REDEFINES TIXNUMF.
	       03  TIXNUMA			      PIC X.
	   02  TIXNUMI				      PIC X(006).
	   02  TITLE1L				      PIC S9(4) COMP.
	   02  TITLE1F				      PIC X.
	   02  FILLER REDEFINES TITLE1F.
	       03  TITLE1A			      PIC X.
	   02  TITLE1I				      PIC X(025).
	   02  STATSL				      PIC S9(4) COMP.
	   02  STATSF				      PIC X.
	   02  FILLER REDEFINES STATSF.
	       03  STATSA			      PIC X.
	   02  STATSI				      PIC X(010).
	   02  LSTUPDL				      PIC S9(4) COMP.
	   02  LSTUPDF				      PIC X.
	   02  FILLER REDEFINES LSTUPDF.
	       03  LSTUPDA			      PIC X.
	   02  LSTUPDI				      PIC X(008).
	   02  UPDBYL				      PIC S9(4) COMP.
	   02  UPDBYF				      PIC X.
	   02  FILLER REDEFINES UPDBYF.
	       03  UPDBYA			      PIC X.
	   02  UPDBYI				      PIC X(006).
       01  SM001MO REDEFINES SM001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSG1O 			      PIC X(071).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATE1O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIME1O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(003).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TITLEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATUSO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TODATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FRDATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SELECTO				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXNUMO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TITLE1O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATSO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  LSTUPDO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDBYO				      PIC X(006).
