      * SYMBOLIC MAP of SM012S Created by CACXBMS Version 6.0.27
       01  SM012MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  TKTNUML				      PIC S9(4) COMP.
	   02  TKTNUMF				      PIC X.
	   02  FILLER REDEFINES TKTNUMF.
	       03  TKTNUMA			      PIC X.
	   02  TKTNUMI				      PIC X(006).
	   02  STATL				      PIC S9(4) COMP.
	   02  STATF				      PIC X.
	   02  FILLER REDEFINES STATF.
	       03  STATA			      PIC X.
	   02  STATI				      PIC X(010).
	   02  TDATEL				      PIC S9(4) COMP.
	   02  TDATEF				      PIC X.
	   02  FILLER REDEFINES TDATEF.
	       03  TDATEA			      PIC X.
	   02  TDATEI				      PIC X(008).
	   02  FRMDTL				      PIC S9(4) COMP.
	   02  FRMDTF				      PIC X.
	   02  FILLER REDEFINES FRMDTF.
	       03  FRMDTA			      PIC X.
	   02  FRMDTI				      PIC X(008).
	   02  DETL1L				      PIC S9(4) COMP.
	   02  DETL1F				      PIC X.
	   02  FILLER REDEFINES DETL1F.
	       03  DETL1A			      PIC X.
	   02  DETL1I				      PIC X(057).
	   02  DETL2L				      PIC S9(4) COMP.
	   02  DETL2F				      PIC X.
	   02  FILLER REDEFINES DETL2F.
	       03  DETL2A			      PIC X.
	   02  DETL2I				      PIC X(057).
	   02  DETL3L				      PIC S9(4) COMP.
	   02  DETL3F				      PIC X.
	   02  FILLER REDEFINES DETL3F.
	       03  DETL3A			      PIC X.
	   02  DETL3I				      PIC X(057).
	   02  DETL4L				      PIC S9(4) COMP.
	   02  DETL4F				      PIC X.
	   02  FILLER REDEFINES DETL4F.
	       03  DETL4A			      PIC X.
	   02  DETL4I				      PIC X(057).
	   02  DETL5L				      PIC S9(4) COMP.
	   02  DETL5F				      PIC X.
	   02  FILLER REDEFINES DETL5F.
	       03  DETL5A			      PIC X.
	   02  DETL5I				      PIC X(057).
	   02  DETL6L				      PIC S9(4) COMP.
	   02  DETL6F				      PIC X.
	   02  FILLER REDEFINES DETL6F.
	       03  DETL6A			      PIC X.
	   02  DETL6I				      PIC X(057).
	   02  REM1L				      PIC S9(4) COMP.
	   02  REM1F				      PIC X.
	   02  FILLER REDEFINES REM1F.
	       03  REM1A			      PIC X.
	   02  REM1I				      PIC X(025).
	   02  REM2L				      PIC S9(4) COMP.
	   02  REM2F				      PIC X.
	   02  FILLER REDEFINES REM2F.
	       03  REM2A			      PIC X.
	   02  REM2I				      PIC X(025).
	   02  REM3L				      PIC S9(4) COMP.
	   02  REM3F				      PIC X.
	   02  FILLER REDEFINES REM3F.
	       03  REM3A			      PIC X.
	   02  REM3I				      PIC X(025).
	   02  REM4L				      PIC S9(4) COMP.
	   02  REM4F				      PIC X.
	   02  FILLER REDEFINES REM4F.
	       03  REM4A			      PIC X.
	   02  REM4I				      PIC X(025).
	   02  REM5L				      PIC S9(4) COMP.
	   02  REM5F				      PIC X.
	   02  FILLER REDEFINES REM5F.
	       03  REM5A			      PIC X.
	   02  REM5I				      PIC X(025).
	   02  REM6L				      PIC S9(4) COMP.
	   02  REM6F				      PIC X.
	   02  FILLER REDEFINES REM6F.
	       03  REM6A			      PIC X.
	   02  REM6I				      PIC X(025).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
       01  SM012MO REDEFINES SM012MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKTNUMO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TDATEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FRMDTO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL1O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL2O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL3O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL4O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL5O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DETL6O				      PIC X(057).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM1O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM2O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM3O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM4O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM5O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REM6O				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
