      * SYMBOLIC MAP of SM05S Created by CACXBMS Version 6.0.27
       01  SM005MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  TKTNUML				      PIC S9(4) COMP.
	   02  TKTNUMF				      PIC X.
	   02  FILLER REDEFINES TKTNUMF.
	       03  TKTNUMA			      PIC X.
	   02  TKTNUMI				      PIC X(006).
	   02  REQBYL				      PIC S9(4) COMP.
	   02  REQBYF				      PIC X.
	   02  FILLER REDEFINES REQBYF.
	       03  REQBYA			      PIC X.
	   02  REQBYI				      PIC X(006).
	   02  TKTLEL				      PIC S9(4) COMP.
	   02  TKTLEF				      PIC X.
	   02  FILLER REDEFINES TKTLEF.
	       03  TKTLEA			      PIC X.
	   02  TKTLEI				      PIC X(025).
	   02  TKDESL				      PIC S9(4) COMP.
	   02  TKDESF				      PIC X.
	   02  FILLER REDEFINES TKDESF.
	       03  TKDESA			      PIC X.
	   02  TKDESI				      PIC X(040).
	   02  STATL				      PIC S9(4) COMP.
	   02  STATF				      PIC X.
	   02  FILLER REDEFINES STATF.
	       03  STATA			      PIC X.
	   02  STATI				      PIC X(010).
	   02  UPDTBYL				      PIC S9(4) COMP.
	   02  UPDTBYF				      PIC X.
	   02  FILLER REDEFINES UPDTBYF.
	       03  UPDTBYA			      PIC X.
	   02  UPDTBYI				      PIC X(006).
	   02  UPDREML				      PIC S9(4) COMP.
	   02  UPDREMF				      PIC X.
	   02  FILLER REDEFINES UPDREMF.
	       03  UPDREMA			      PIC X.
	   02  UPDREMI				      PIC X(025).
	   02  UPDTL				      PIC S9(4) COMP.
	   02  UPDTF				      PIC X.
	   02  FILLER REDEFINES UPDTF.
	       03  UPDTA			      PIC X.
	   02  UPDTI				      PIC X(019).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
       01  SM005MO REDEFINES SM005MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKTNUMO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQBYO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKTLEO				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKDESO				      PIC X(040).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDTBYO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDREMO				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDTO				      PIC X(019).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
