      * SYMBOLIC MAP of SM05S Created by CACXBMS Version 6.0.27
       01  SM005MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  TKTNUML				      PIC S9(4) COMP.
	   02  TKTNUMF				      PIC X.
	   02  FILLER REDEFINES TKTNUMF.
	       03  TKTNUMA			      PIC X.
	   02  TKTNUMI				      PIC X(006).
	   02  REQBYL				      PIC S9(4) COMP.
	   02  REQBYF				      PIC X.
	   02  FILLER REDEFINES REQBYF.
	       03  REQBYA			      PIC X.
	   02  REQBYI				      PIC X(008).
	   02  TKTLEL				      PIC S9(4) COMP.
	   02  TKTLEF				      PIC X.
	   02  FILLER REDEFINES TKTLEF.
	       03  TKTLEA			      PIC X.
	   02  TKTLEI				      PIC X(025).
	   02  TKDES1L				      PIC S9(4) COMP.
	   02  TKDES1F				      PIC X.
	   02  FILLER REDEFINES TKDES1F.
	       03  TKDES1A			      PIC X.
	   02  TKDES1I				      PIC X(050).
	   02  TKDES2L				      PIC S9(4) COMP.
	   02  TKDES2F				      PIC X.
	   02  FILLER REDEFINES TKDES2F.
	       03  TKDES2A			      PIC X.
	   02  TKDES2I				      PIC X(050).
	   02  STATL				      PIC S9(4) COMP.
	   02  STATF				      PIC X.
	   02  FILLER REDEFINES STATF.
	       03  STATA			      PIC X.
	   02  STATI				      PIC X(010).
	   02  UPDTBYL				      PIC S9(4) COMP.
	   02  UPDTBYF				      PIC X.
	   02  FILLER REDEFINES UPDTBYF.
	       03  UPDTBYA			      PIC X.
	   02  UPDTBYI				      PIC X(008).
	   02  UPDREM1L 			      PIC S9(4) COMP.
	   02  UPDREM1F 			      PIC X.
	   02  FILLER REDEFINES UPDREM1F.
	       03  UPDREM1A			      PIC X.
	   02  UPDREM1I 			      PIC X(025).
	   02  UPDREM2L 			      PIC S9(4) COMP.
	   02  UPDREM2F 			      PIC X.
	   02  FILLER REDEFINES UPDREM2F.
	       03  UPDREM2A			      PIC X.
	   02  UPDREM2I 			      PIC X(025).
	   02  UPDTL				      PIC S9(4) COMP.
	   02  UPDTF				      PIC X.
	   02  FILLER REDEFINES UPDTF.
	       03  UPDTA			      PIC X.
	   02  UPDTI				      PIC X(020).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
       01  SM005MO REDEFINES SM005MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKTNUMO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQBYO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKTLEO				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKDES1O				      PIC X(050).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TKDES2O				      PIC X(050).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDTBYO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDREM1O 			      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDREM2O 			      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDTO				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
